[
  {
    "name": "Box of Chocolate Candy",
    "price": "24.99",
    "image": "https://web-scraping.dev/assets/products/orange-chocolate-box-medium-1.webp",
    "description": "Indulge your sweet tooth with our Box of Chocolate Candy. Each box contains an assortment of rich, flavorful chocolates with a smooth, creamy filling. Choose from a variety of flavors including zesty orange and sweet cherry. Whether you're looking for the perfect gift or just want to treat yourself, our Box of Chocolate Candy is sure to satisfy.",
    "link": "https://web-scraping.dev/product/1"
  },
  {
    "name": "Dark Red Energy Potion",
    "price": "4.99",
    "image": "https://web-scraping.dev/assets/products/darkred-potion.webp",
    "description": "Unleash the power within with our 'Dark Red Potion', an energy drink as intense as the games you play. Its deep red color and bold cherry cola flavor are as inviting as they are invigorating. Bring out the best in your gaming performance, and unlock your full potential.",
    "link": "https://web-scraping.dev/product/2"
  },
  {
    "name": "Teal Energy Potion",
    "price": "4.99",
    "image": "https://web-scraping.dev/assets/products/teal-potion.webp",
    "description": "Experience a surge of vitality with our 'Teal Potion', an exceptional energy drink designed for the gaming community. With its intriguing teal color and a flavor that keeps you asking for more, this potion is your best companion during those long gaming nights. Every sip is an adventure - let the quest begin!",
    "link": "https://web-scraping.dev/product/3"
  },
  {
    "name": "Red Energy Potion",
    "price": "4.99",
    "image": "https://web-scraping.dev/assets/products/red-potion.webp",
    "description": "Elevate your game with our 'Red Potion', an extraordinary energy drink that's as enticing as it is effective. This fiery red potion delivers an explosive berry flavor and an energy kick that keeps you at the top of your game. Are you ready to level up?",
    "link": "https://web-scraping.dev/product/4"
  },
  {
    "name": "Blue Energy Potion",
    "price": "4.99",
    "image": "https://web-scraping.dev/assets/products/blue-potion.webp",
    "description": "Ignite your gaming sessions with our 'Blue Energy Potion', a premium energy drink crafted for dedicated gamers. Inspired by the classic video game potions, this energy drink provides a much-needed boost to keep you focused and energized. It's more than just an energy drink - it's an ode to the gaming culture, packaged in an aesthetically pleasing potion-like bottle that'll make you feel like you're in your favorite game world. Drink up and game on!",
    "link": "https://web-scraping.dev/product/5"
  }
]